tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mongodb/brew"
brew "act"
brew "agg"
brew "ansible"
brew "ansifilter"
brew "zstd"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asciinema"
brew "ncurses"
brew "asciiquarium"
brew "aws-iam-authenticator"
brew "docutils"
brew "awscli"
brew "libssh2"
brew "bat"
brew "glib"
brew "pkg-config"
brew "certbot"
brew "cfn-lint"
brew "chrome-cli"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "consul"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "dnstracer"
brew "docker-completion"
brew "emojify"
brew "entr"
brew "fd"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fio"
brew "fish"
brew "fortune"
brew "freeimage"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
# brew "giflossy"
brew "giflib"
brew "git"
brew "git-extras"
brew "glfw"
brew "glslang"
brew "go"
brew "gobject-introspection"
brew "gotop"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "openjdk"
brew "groovy"
brew "hcl2json"
brew "helm"
brew "pygments"
brew "howdoi"
brew "htop"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "openssl@1.1"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "ipcalc"
brew "jenv"
brew "jp2a"
brew "jq"
brew "jsonnet"
brew "k6"
brew "lastpass-cli"
brew "launchctl-completion"
brew "lcdf-typetools"
brew "lftp"
brew "libssh"
brew "libzip"
brew "locateme"
brew "lolcat"
brew "mas"
brew "maven"
brew "mongosh"
brew "mtr"
brew "navi"
brew "nmap"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "pkcs11-helper"
brew "openvpn"
brew "peco"
brew "pip-completion"
brew "pipes-sh"
brew "plantuml"
brew "rdfind"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
# brew "stormssh-completion"
brew "telnet"
brew "terraform"
brew "terraform-docs"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "urlview"
brew "vault"
brew "w3m"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
# brew "mongodb/brew/mongodb-community"
brew "eksctl"
cask "1password-cli"
cask "anaconda"
cask "cheatsheet"
cask "customshortcuts"
cask "font-engagement"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-powerline-symbols"
cask "google-cloud-sdk"
cask "meld"
cask "ngrok"
cask "powershell"
cask "slack"
cask "ssh-tunnel-manager"
cask "wireshark"
mas "Adblock Plus", id: 1432731683
mas "Amphetamine", id: 937984704
mas "AWS Extend Switch Roles", id: 1592710340
#mas "C. Anatomy", id: 1141323850
#mas "CleanMyMac X", id: 1339170533
mas "Curve", id: 1219074514
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "Hotspot Shield", id: 771076721
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
#mas "Kindle Classic", id: 405399194
#mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
#mas "PCalc", id: 403504866
#mas "Pixelmator Pro", id: 1289583905
mas "PrettyJSON for Safari", id: 1445328303
mas "Remote Desktop", id: 409907375
mas "Speedtest", id: 1153157709
#mas "Vimari", id: 1480933944
mas "WiFi Speed Test", id: 1455463454
#mas "World of Guns", id: 1143779751
#mas "Civilization VI", id: 1123795278
vscode "4ops.terraform"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anseki.vscode-color"
vscode "attilabuti.mustache-syntax-vscode"
vscode "batisteo.vscode-django"
vscode "bierner.emojisense"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bmalehorn.shell-syntax"
vscode "boyswan.glsl-literal"
vscode "chen86860.json-sorter"
vscode "ChenJun.vscode-ipython"
vscode "christian-kohler.path-intellisense"
vscode "circlecodesolution.ccs-flutter-color"
vscode "cmstead.js-codeformer"
vscode "codezombiech.gitignore"
vscode "danielroedl.meld-diff"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dtoplak.vscode-glsllint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eeyore.yapf"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "gamunu.vscode-yarn"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "Grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "hediet.debug-visualizer"
vscode "henoc.svgeditor"
vscode "idleberg.emoji-code"
vscode "jasonnutter.search-node-modules"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jmviz.quote-list"
vscode "jock.svg"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "kddejong.vscode-cfn-lint"
vscode "KevinRose.vsc-python-indent"
vscode "liamdawson.jsonnet-language"
vscode "liviuschera.noctis"
vscode "lllllllqw.jsdoc"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.MagicPython"
vscode "malmaud.tmux"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "octref.vetur"
vscode "omBratteng.nftables"
vscode "Perkovec.emoji"
vscode "PKief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pranaygp.vscode-css-peek"
vscode "raczzalan.webgl-glsl-editor"
vscode "rajeshroyal896.extended-html5-boilerplate"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "Remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "rogalmic.bash-debug"
vscode "Sebbia.jsonnetng"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SimonSiefke.svg-preview"
vscode "slevesque.shader"
vscode "standard.vscode-standard"
vscode "thomaskoppelaar.markdown-wiki-links-preview"
vscode "timonwong.shellcheck"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tushortz.python-extended-snippets"
vscode "ue.alphabetical-sorter"
vscode "usernamehw.errorlens"
vscode "vaisakh96.pythonic-snippets"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "waderyan.gitblame"
vscode "wholroyd.jinja"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
